Autodesk.Revit.DB.IFC.IFCDataPrimitiveType
Used in operations to specify the primitive type of an IFCData.
Since:
2013

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Number
Number.

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Unknown
Unknown.

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Aggregate
Represents IFCAggregate.

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Instance
Represents IFCAnyHandle.

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Enumeration
Enumeration.
When reading or writing an IFCData of primitive type Enumeration,
the value will be the string representation of the enumeration value
as seen in the IFC specification.

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Binary
Binary.
When reading or writing an IFCData of primitive type Binary,
the value will be the string representation of the binary value
as seen in the IFC specification.

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.String
String.

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Logical
IFCLogical type.

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Boolean
Boolean.

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Double
Double.

Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Integer
Integer.